import { StockDataItem, StockItem } from '@/types';

// 백엔드에서 받은 2차원 데이터를 가정
export const backendData: number[][] = [
  [
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ], // 무의미
  [
    8, 6, 4, 6, 14, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ], // candy
  [
    8, 10, 14, 4, 6, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ], // cupcake
  [
    8, 6, 12, 4, 20, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ], // gift
  [
    8, 30, 24, 16, 12, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ], // hat
  [
    8, 12, 18, 14, 8, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ], // socks
];

// 아이템 ID에 해당하는 key 리스트
export const itemNameList: StockItem[] = [
  'candy',
  'cupcake',
  'gift',
  'hat',
  'socks',
];

// [변환] 백엔드 데이터 => 프론트 차트
export const chartData = (
  backendData: number[][],
  itemNameList: StockItem[],
): StockDataItem[] => {
  // 첫 번째 행(무의미한 데이터) 제외하고 1 ~ 5번째 사용
  return backendData.slice(1, 6).map((itemData, index) => {
    const data = itemData.map((price, time) => ({
      x: time,
      y: price,
    }));

    return {
      id: itemNameList[index],
      data,
    };
  });
};

// // 플레이어 이름
// ['player1', 'player2', 'player3', 'player4']

// // 지분: 2차원 배열
//   [
//     [4, 6, 8, 8], // 트리 1 - 각 플레이어가 가진 개수
//     [4, 6, 8, 8], // 트리 2 - 각 플레이어가 가진 개수
//     [4, 6, 8, 8], // 트리 3 - 각 플레이어가 가진 개수
//     [4, 6, 8, 8], // 트리 4 - 각 플레이어가 가진 개수
//     [4, 6, 8, 8], // 트리 5 - 각 플레이어가 가진 개수
//   ];

// // 주식 변동 (80초 초과 100초 미만인 상태)
// [
//   [8, 3, 4, 6, 0, 0, 0, ...],
//   [8, 3, 4, 6, 0, 0, 0, ...],
//   [8, 3, 4, 6, 0, 0, 0, ...],
//   [8, 3, 4, 6, 0, 0, 0, ...],
//   [8, 3, 4, 6, 0, 0, 0, ...],
// ]
